class ImportantQuestions:
    text0 = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    text1 = ("Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто "
             "сделать несколько заказов — один за другим.")
    text2 = ("Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды "
             "начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, "
             "суточная аренда закончится 9 мая в 20:30.")
    text3 = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    text4 = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    text5 = ("Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься "
             "без передышек и во сне. Зарядка не понадобится.")
    text6 = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    text7 = "Да, обязательно. Всем самокатов! И Москве, и Московской области."


class ScooterOrderData:
    data_sets = {
        'data_set_1': {
            'name': 'Петр',
            'surname': 'Петров',
            'address': 'Маршала Бирюзова',
            'station': 'Октябрьское поле',
            'phone_number': '+7985485732',
            'date': '26.12.2024',
            'rent_time': 2,
            'comment_for_courier': 'Нужно очень быстро'
        },
        'data_set_2': {
            'name': 'Иван',
            'surname': 'Иванов',
            'address': 'Крондштатский бульвар',
            'station': 'Водный стадион',
            'phone_number': '79951243543',
            'date': '02.07.2024',
            'rent_time': 1,
            'comment_for_courier': 'Можно не торопиться'
        },
    }


class NamesOfButtons:
    WANT_TO_MAKE_ORDER = "Хотите оформить заказ"
    ORDER_MADE = "Заказ оформлен"
